music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.update!(session_token: self.session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Vmj3zumAjeUw4k0oMaqodg"], ["updated_at", "2019-07-04 14:31:21.557371"], ["id", 6]]