music_app/app/views/albums/show.html.erb


<% @album = Album.find_by(id: params[:id]) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]