music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(
      band_id: params[:album][:band_id],
      title: params[:album][:title],
      yr: params[:album][:yr],
      studio: params[:album][:studio]
      )
    if @album.save
      redirect_to band_url(@album.band)
    else
      @album.band_id = Band.first.id
---
INSERT INTO "albums" ("band_id", "title", "yr", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 4], ["title", "asdf"], ["yr", 3233], ["studio", true], ["created_at", "2019-07-04 18:59:26.587369"], ["updated_at", "2019-07-04 18:59:26.587369"]]
SELECT  "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT $1  [["LIMIT", 1]]