music_app/app/controllers/bands_controller.rb

UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Penny and the Pets"], ["updated_at", "2019-07-04 17:44:14.002069"], ["id", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "AJR"], ["updated_at", "2019-07-04 17:45:22.468714"], ["id", 4]]
---
  def update
    band = Band.update(band_params)
    if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by(id: params[id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
    band = Band.find_by(id: params[:id])
    if band
      band.destroy