music_app/app/controllers/bands_controller.rb

  def update
    band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]